Revit 2027 API
AnalysisDisplayDeformedShapeSettings Constructor
Overload List
Name | Description
AnalysisDisplayDeformedShapeSettings() |  Constructs a default instance of deformed shape settings.
AnalysisDisplayDeformedShapeSettings(AnalysisDisplayDeformedShapeSettings) |  Constructs a new copy of the input AnalysisDisplayDeformedShapeSettings object.
Top
See Also
Reference
AnalysisDisplayDeformedShapeSettings Class
Autodesk.Revit.DB.Analysis Namespace